RT-Thread/rt-thread/bsp/apm32/libraries/APM32F4xx_Library/APM32F4xx_StdPeriphDriver/src/apm32f4xx_can.c
    /** ERRSTS register */
    if(flag == 0x30F00070)
    {
        can->ERRSTS = RESET;
    }
    else
    {
        flagtmp = flag & 0x000FFFFF;
        if((flag & 0x02000000) != RESET)
        {
            can->RXF0 = flagtmp;
        }
        else if((flag & 0x04000000) != RESET)
        {
            can->RXF1 = flagtmp;
        }
        else if((flag & 0x08000000) != RESET)
        {
            can->TXSTS = flagtmp;
        }
        else
        {
            can->MSTS = flagtmp;
        }
    }
}

/*!
 * @brief     Read whether the specified can interrupt has occurred or not.
 *
 * @param     can: Select the CAN peripheral.
 *
 * @param     interrupts: specifies the CAN interrupt sources
 *                        This parameter can be one of the following values:
 *                        @arg CAN_INT_TXME   : Transmit mailbox empty Interrupt
 *                        @arg CAN_INT_F0MP   : FIFO 0 message pending Interrupt
 *                        @arg CAN_INT_F0FULL : FIFO 0 full Interrupt
 *                        @arg CAN_INT_F0OVR  : FIFO 0 overrun Interrupt
 *                        @arg CAN_INT_F1MP   : FIFO 1 message pending Interrupt
 *                        @arg CAN_INT_F1FULL : FIFO 1 full Interrupt
 *                        @arg CAN_INT_F1OVR  : FIFO 1 overrun Interrupt
 *                        @arg CAN_INT_ERRW   : Error warning Interrupt
 *                        @arg CAN_INT_ERRP   : Error passive Interrupt
 *                        @arg CAN_INT_BOF    : Bus-off Interrupt
 *                        @arg CAN_INT_LEC    : Last error record code Interrupt
 *                        @arg CAN_INT_ERR    : Error Interrupt
 *                        @arg CAN_INT_WUP    : Wake-up Interrupt
 *                        @arg CAN_INT_SLEEP  : Sleep acknowledge Interrupt
 *
 * @retval    status : SET or RESET
 */
uint8_t CAN_ReadIntFlag(CAN_T* can, CAN_INT_T flag)
{
    uint8_t status = 0;

    if((can->INTEN & flag) != RESET)
    {
        switch (flag)
        {
        case CAN_INT_TXME:
            status = can->TXSTS_B.REQCFLG0;
            status |= can->TXSTS_B.REQCFLG1;
            status |= can->TXSTS_B.REQCFLG2;
            break;
        case CAN_INT_F0MP:
            status = can->RXF0_B.FMNUM0;
            break;
        case CAN_INT_F0FULL:
            status = can->RXF0_B.FFULLFLG0;
            break;
        case CAN_INT_F0OVR:
            status = can->RXF0_B.FOVRFLG0;
            break;
        case CAN_INT_F1MP:
            status = can->RXF1_B.FMNUM1;
            break;
        case CAN_INT_F1FULL:
            status = can->RXF1_B.FFULLFLG1;
            break;
        case CAN_INT_F1OVR:
            status = can->RXF1_B.FOVRFLG1;
            break;
        case CAN_INT_WUP:
            status = can->MSTS_B.WUPIFLG;
            break;
        case CAN_INT_SLEEP:
            status = can->MSTS_B.SLEEPIFLG;
            break;
        case CAN_INT_ERRW:
            status = can->ERRSTS_B.ERRWFLG;
            break;
        case CAN_INT_ERRP:
            status = can->ERRSTS_B.ERRPFLG;
            break;
        case CAN_INT_BOF:
            status = can->ERRSTS_B.BOFLG;
            break;
        case CAN_INT_LEC:
            status = can->ERRSTS_B.LERRC;
            break;
        case CAN_INT_ERR:
            status = can->MSTS_B.ERRIFLG;
            break;
        default:
            status = RESET;
            break;
        }
    }
    else
    {
        status = RESET;
    }
    return status;
}

/*!
 * @brief     Clears the can's interrupt flag.
 *
 * @param     can: Select the CAN peripheral which can be CAN1 or CAN2.
 *
 * @param     flag: Interrupt pending bit to clear
 *                  This parameter can be one of the following values:
 *                  @arg CAN_INT_TXME   : Transmit mailbox empty Interrupt
 *                  @arg CAN_INT_F0FULL : FIFO 0 full Interrupt
 *                  @arg CAN_INT_F0OVR  : FIFO 0 overrun Interrupt
 *                  @arg CAN_INT_F1FULL : FIFO 1 full Interrupt
 *                  @arg CAN_INT_F1OVR  : FIFO 1 overrun Interrupt
 *                  @arg CAN_INT_ERRW   : Error warning Interrupt
 *                  @arg CAN_INT_ERRP   : Error passive Interrupt
 *                  @arg CAN_INT_BOF    : Bus-off Interrupt
 *                  @arg CAN_INT_LEC    : Last error record code Interrupt
 *                  @arg CAN_INT_ERR    : Error Interrupt
 *                  @arg CAN_INT_WUP    : Wake-up Interrupt
 *                  @arg CAN_INT_SLEEP  : Sleep acknowledge Interrupt
 *
 * @retval    None
 */
void CAN_ClearIntFlag(CAN_T* can, CAN_INT_T flag)
{
    switch (flag)
    {
    case CAN_INT_TXME:
        can->TXSTS_B.REQCFLG0 = BIT_SET;
        can->TXSTS_B.REQCFLG1 = BIT_SET;
        can->TXSTS_B.REQCFLG2 = BIT_SET;
        break;
    case CAN_INT_F0FULL:
        can->RXF0_B.FFULLFLG0 = BIT_SET;
        break;
    case CAN_INT_F0OVR:
        can->RXF0_B.FOVRFLG0  = BIT_SET;
        break;
    case CAN_INT_F1FULL:
        can->RXF1_B.FFULLFLG1 = BIT_SET;
        break;
    case CAN_INT_F1OVR:
        can->RXF1_B.FOVRFLG1  = BIT_SET;
        break;
    case CAN_INT_WUP:
        can->MSTS_B.WUPIFLG   = BIT_SET;
        break;
    case CAN_INT_SLEEP:
        can->MSTS_B.SLEEPIFLG = BIT_SET;
        break;
    case CAN_INT_ERRW:
        can->MSTS_B.ERRIFLG = BIT_SET;
        break;
    case CAN_INT_ERRP:
        can->MSTS_B.ERRIFLG = BIT_SET;
        break;
    case CAN_INT_BOF:
        can->MSTS_B.ERRIFLG = BIT_SET;
        break;
    case CAN_INT_LEC:
        can->ERRSTS_B.LERRC = BIT_RESET;
        can->MSTS_B.ERRIFLG = BIT_SET;
        break;
    case CAN_INT_ERR:
        can->ERRSTS_B.LERRC = BIT_RESET;
        can->MSTS_B.ERRIFLG = BIT_SET;
        break;
    default:
        break;
    }
}

/**@} end of group CAN_Functions */
/**@} end of group CAN_Driver */
/**@} end of group APM32F4xx_StdPeriphDriver */
